//ブランチ
//作業環境の変更履歴を記録していくためのもの、のちに開発環境下へと統合される
//VS CODE内では下部よりブランチの管理を行う

//プル
//開発環境が更新された際に自分の作業環境へと反映させる際に使用する
//VS CODE内では左部のソース管理より行う

//コンフリクト
//開発環境が更新され、自分の作業環境へプルした際に発生するバージョンの衝突
//同ファイル、同行の変更が同時に行われた際に発生する、その際は更新順に下の行へ記入を行う

//マージ
//ブランチを分けて行った作業を開発環境へ統一する
//VS CODE内では左部のソース管理より行う

//プルリクエスト
//ブランチを分けて行った作業を開発環境へ統一依頼すること
//GitHub内で操作を行う

//フォーク
//他者のリモートリポジトリを自分のリモートリポジトリへ複製を行う際に使用

//スタッシュ
//複数のブランチでの作業中に現ブランチで行った変更を一時的に避難させ、別ブランチから再度戻ってきた時に
//変更後より作業を再開させることできる

//Diff
//ファイルの変更、ファイル内の変更内容を確認をする際に使用